🚀&nbsp; env0 had composed a PR Plan for environment [Default Organization Project / output-16568 ](http://dev.dev.env0.com/p/cb9b01ac-6b3f-4f3c-a2dc-05e322089c23/environments/79d49ae0-58a6-4e5f-bcbd-6754c95472cd):
```
Plan: 3 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform will perform the following actions:


  # aws_db_instance.example will be created
+   resource "aws_db_instance" "example" {
+       address                               = (known after apply)
+       allocated_storage                     = 10
+       apply_immediately                     = (known after apply)
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = (known after apply)
+       backup_window                         = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       db_subnet_group_name                  = (known after apply)
+       delete_automated_backups              = true
+       endpoint                              = (known after apply)
+       engine                                = "mysql"
+       engine_version                        = "5.7"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = (known after apply)
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t3.micro"
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
+       license_model                         = (known after apply)
+       maintenance_window                    = (known after apply)
+       monitoring_interval                   = 0
+       monitoring_role_arn                   = (known after apply)
+       multi_az                              = (known after apply)
+       name                                  = "mydb"
+       nchar_character_set_name              = (known after apply)
+       option_group_name                     = (known after apply)
+       parameter_group_name                  = "default.mysql5.7"
+       password                              = (sensitive value)
+       performance_insights_enabled          = false
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       publicly_accessible                   = false
+       replicas                              = (known after apply)
+       resource_id                           = (known after apply)
+       skip_final_snapshot                   = true
+       snapshot_identifier                   = (known after apply)
+       status                                = (known after apply)
+       storage_type                          = (known after apply)
+       tags_all                              = (known after apply)
+       timezone                              = (known after apply)
+       username                              = "foo"
+       vpc_security_group_ids                = (known after apply)
    }


  # aws_vpc.example will be created
+   resource "aws_vpc" "example" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = (known after apply)
+       enable_dns_support                   = true
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags_all                             = (known after apply)
    }

  # null_resource.null will be created
+   resource "null_resource" "null" {
+       id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "test_read_only_regression_free_Text" but a value was found in file
│ "env0.auto.tfvars.json". If you meant to use this value, add a "variable"
│ block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "test_read_only_regression" but a value was found in file
│ "env0.auto.tfvars.json". If you meant to use this value, add a "variable"
│ block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```
</details>


```
Monthly cost change for Wassap124/misc-dev/.env0workdir/.tf-plan
Amount:  +$13.56 ($0.00 -> $13.56)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
Project: Wassap124/misc-dev/.env0workdir/.tf-plan

+ aws_db_instance.example
  +$13.56

+     Database instance
      +$12.41

+     Database storage
      +$1.15

Monthly cost change for Wassap124/misc-dev/.env0workdir/.tf-plan
Amount:  +$13.56 ($0.00 -> $13.56)

----------------------------------
Key: ~ changed, + added, - removed
```
</details>


[Full PR Plan logs on env0](http://dev.dev.env0.com/p/cb9b01ac-6b3f-4f3c-a2dc-05e322089c23/environments/79d49ae0-58a6-4e5f-bcbd-6754c95472cd/deployments/9eb8f5d4-5e92-487a-80d9-aedfbfd06a74)